{
  "Main": {
    "name": "Оскар Арсланов",
    "job": "Frontend разработчик",
    "bronzeLink": "Бронзовый медалист WorldSkills International (Россия, Казань)",
    "silverLink": "Серебрянный медалист EuroSkills (Швеция, Гётеборг)",
    "where": "по Мобильной робототехнике (LabVIEW и Java)",
    "competitions": "Много различных национальных наград WorldSkills Competitions, таких как Китай, Япония, Индия, Южная Корея, Беларусь, Гон Конг.",
    "member": "Участник Национальной сборной России с 2016 по 2019 год",
    "migrated": "Мигрировал из Росси в Казахстан и собираюсь в Сербию зимой 2023",
    "about": "Обо мне",
    "contacts": "Контакты"
  },
  "Header": {
    "about": "Обо мне",
    "portfolio": "Портфолио",
    "contacts": "Контакты"
  },
  "About": {
    "title": "Привет! Я Оскар Арсланов и здесь, я хотел бы рассказать о себе",
    "school": "Школа",
    "contentSchool": "В детстве, до 14 лет, я учился в гимназии №90 города Казани, в России. В то время я ничем особым не занимался: учился и занимался в футбольной шкое. В футболе имел некоторые успехи, имею 1ый юношеский разряд. Играл во второй юношеской команде ФК 'Рубин' и победил во многих городских и региональный чемпионатах Республики Татарстан. Наконец, я закончил школу со средним баллом GPA 4.55/5.",
    "college": "Колледж",
    "contentCollege": "Ушел из школы после 9ого класса и поступил в колледж на 4ех-летнюю программу обучения по компьютерным технологиям. Во время 2ого года учебы, я решил что-то менять в жизни и начал самообучаться, начал с администрирования Linux систем по видеороликам в ютубе и книгам из библиотеки. Спустя 3-4 месяца обучения, надоело делать это в одиночку. Однажды, я пошел на курсы дополнительного образования в моем колледже по направлению 'WorldSkills Mobile Robotics.' У меня всегда были способности к естественно-научным направлениям, в том числе к программированию. В то время у меня не было особых знаний в области робототехники, даже пайки. В данном направлении является командым: 1 программист, а другой механик. Естественно я полез в программирование и спустя 6 месяцев изучения LabVIEW я попал на Национальный чемпионат России WorldSkills. Без особых проблем я его выиграл",
    "euroSkills": "EuroSkills",
    "contentEuroSkills": "Победив в Национальном чемпионате как участник сборной Республики Татарстан, я продолжил бороться на место в сборной России. Опять же без особых сложностей я попал в Национальную сброную и ,в декабре 2016, я попал на свой первый международный чемпионат EuroSkills, в городе Гётеборг в Швеции",
    "worldSkills": "WorldSkills",
    "contentWorldSkills": "После EuroSkills, я участвовал во многих национальных чемпионатах других стран, таких как: Китай, Япония, Индия, Южная Корея, Беларусь, и Гон Конг - все это в рамках подготовки в WorldSkills International в 2019 году в моем родном городе - Казань. В марте 2019 я на месяц ездил в Южную Корею на стажировку с Samsung в центр подготовки сборной Южной Кореи - G.I.F.T.S.  В августе 2019 года начался WorldSkills International Competition. Прошло все довольно спокойно, так как была проделана огромная работа по подготвке как hardskills, так и softskills. Я с напарником не совершили ни одной ошибки за время чемпионата, однако наши основные соперники - Китай и Южная Корея были быстрее нас и получили больше баллов. В итоге они нас обошли и я получил бронзовую медаль WSI competition в 2019.",
    "becomingProgrammer": "Как я пришел в программирование",
    "contentBecomingProgrammer": "После EuroSkills и WorldSkills, у меня были встречи с первыми лицами страны, в том числе с В.В.Путиным, много различных плюшек. 2020 год был годом ментального отдыха от всего, и я ничего особо не делал). В феврале 2021 года я поулчил предложение поработать техническим директором направления WorldSkills в Сахалинской области Российской Федерации. Но к сожалению, не договорились по цене и в целом по треку развития, поэтому я отказался. Позже, в июле, я получил оффер на преподавателя робототехники и мехатроники в Московском Государственном Образовательном Комплексе в городе Москва. На этот оффер я согласился, так как давно хотелось продолжить двигаться по жизни, 'изолироваться' от друзей и уйти в работу/учебу. Помимо работы я начал изучать Java, как в рамках работы нужно было, да и для себя, так как оставаться преподавателем меня не привлекало. Спустя год обучения и коучинга команды по робототехнике, мы заняли 1ое место на национальном чемпионате России по юниорам(до 16 лет) и по основной категории. Спустя 8-10 месяцев изучения на Javarush и по книжкам я начал ковырять Spring Framework. Пару месяцев поизучал, начал понимать что сложно найти работу джуну Java разработчику, особенно в условиях войны, и решил поковырять React + JS. JS сразу не зашел, без типизации прям глаз резало после Java. В сентябре 2022 года мне брат(сеньор в Orion Innovation) предложил поработать на проекте в России, я, конечно, обрадовался нормальной работе и согласился. Закрепившись на позиции Frontend разработчик, в октябре я уехал из России в Казахстан с женой."
  },
  "Portfolio": {
    "code": "Код доступен здесь",
    "chartjs": {
      "title": "Вся аналитика в одном кабинете",
      "track": "Отслеживайте работу голосового ассистента в личном кабинете",
      "uniq": "Уникальные виджеты позволяют настроить дашборд под задачи различных подразделений вашей компании",
      "calls": "Звонки",
      "outgoingCalls": "Исходящие звонки",
      "incomingCalls": "Входящие звонки",
      "rejects": "Отказы от подключения",
      "rostov": "Ростов-на-Дону"
    },
    "fuse": {
      "placeholder": "Начните вводить (минимум 3 знака)",
      "found": "Найдено шуток"
    },
    "login": {
      "title": "Войти",
      "pass": "Пароль",
      "remember": "Запомнить меня",
      "forget": "Забыли пароль"
    },
    "chat": {
      "title": "Бот чат",
      "ai": "ИИ сервис",
      "placeholder": "Начните вводить..."
    },
    "todo": {
      "left": "туду осталось",
      "all": "Все",
      "active": "Активные",
      "completed": "Завершенные",
      "create": "Создать",
      "clear": "Очистить",
      "clearCompleted": "Очистка завершена",
      "delete": "Вы действительно хотите удалить "
    }, 
    "registration": {
      "already": "Уже зарегестрированы",
      "title": "Регистрация",
      "name": "Имя",
      "phone": "Телефон",
      "password": "Пароль",
      "confirm": "Подтверждение пароля",
      "policyText": "Нажимая кнопку 'Зарегестрироваться' вы соглашаетесь с пользовательским ",
      "policyButton": "соглашением",
      "register": "Зарегестрироваться",
      "succes": "Запрос отправлен",
      "error": "Пароли должны совпадать"
    },
    "file": {
      "load": "Загрузить"
    }
  }
}
